thelemon22/regis/demo_projects/dsPIC33E/h/p33EP256MU814.h
extern volatile IC12CON2BITS IC12CON2bits __attribute__((__sfr__));

extern volatile unsigned int  IC12BUF __attribute__((__sfr__));
extern volatile unsigned int  IC12TMR __attribute__((__sfr__));
extern volatile unsigned int  IC13CON1 __attribute__((__sfr__));
__extension__ typedef struct tagIC13CON1BITS {
  union {
    struct {
      unsigned ICM:3;
      unsigned ICBNE:1;
      unsigned ICOV:1;
      unsigned ICI:2;
      unsigned :3;
      unsigned ICTSEL:3;
      unsigned ICSIDL:1;
    };
    struct {
      unsigned ICM0:1;
      unsigned ICM1:1;
      unsigned ICM2:1;
      unsigned :2;
      unsigned ICI0:1;
      unsigned ICI1:1;
      unsigned :3;
      unsigned ICTSEL0:1;
      unsigned ICTSEL1:1;
      unsigned ICTSEL2:1;
    };
  };
} IC13CON1BITS;
extern volatile IC13CON1BITS IC13CON1bits __attribute__((__sfr__));

extern volatile unsigned int  IC13CON2 __attribute__((__sfr__));
__extension__ typedef struct tagIC13CON2BITS {
  union {
    struct {
      unsigned SYNCSEL:5;
      unsigned :1;
      unsigned TRIGSTAT:1;
      unsigned ICTRIG:1;
      unsigned IC32:1;
    };
    struct {
      unsigned SYNCSEL0:1;
      unsigned SYNCSEL1:1;
      unsigned SYNCSEL2:1;
      unsigned SYNCSEL3:1;
      unsigned SYNCSEL4:1;
    };
  };
} IC13CON2BITS;
extern volatile IC13CON2BITS IC13CON2bits __attribute__((__sfr__));

extern volatile unsigned int  IC13BUF __attribute__((__sfr__));
extern volatile unsigned int  IC13TMR __attribute__((__sfr__));
extern volatile unsigned int  IC14CON1 __attribute__((__sfr__));
__extension__ typedef struct tagIC14CON1BITS {
  union {
    struct {
      unsigned ICM:3;
      unsigned ICBNE:1;
      unsigned ICOV:1;
      unsigned ICI:2;
      unsigned :3;
      unsigned ICTSEL:3;
      unsigned ICSIDL:1;
    };
    struct {
      unsigned ICM0:1;
      unsigned ICM1:1;
      unsigned ICM2:1;
      unsigned :2;
      unsigned ICI0:1;
      unsigned ICI1:1;
      unsigned :3;
      unsigned ICTSEL0:1;
      unsigned ICTSEL1:1;
      unsigned ICTSEL2:1;
    };
  };
} IC14CON1BITS;
extern volatile IC14CON1BITS IC14CON1bits __attribute__((__sfr__));

extern volatile unsigned int  IC14CON2 __attribute__((__sfr__));
__extension__ typedef struct tagIC14CON2BITS {
  union {
    struct {
      unsigned SYNCSEL:5;
      unsigned :1;
      unsigned TRIGSTAT:1;
      unsigned ICTRIG:1;
      unsigned IC32:1;
    };
    struct {
      unsigned SYNCSEL0:1;
      unsigned SYNCSEL1:1;
      unsigned SYNCSEL2:1;
      unsigned SYNCSEL3:1;
      unsigned SYNCSEL4:1;
    };
  };
} IC14CON2BITS;
extern volatile IC14CON2BITS IC14CON2bits __attribute__((__sfr__));

extern volatile unsigned int  IC14BUF __attribute__((__sfr__));
extern volatile unsigned int  IC14TMR __attribute__((__sfr__));
extern volatile unsigned int  IC15CON1 __attribute__((__sfr__));
__extension__ typedef struct tagIC15CON1BITS {
  union {
    struct {
      unsigned ICM:3;
      unsigned ICBNE:1;
      unsigned ICOV:1;
      unsigned ICI:2;
      unsigned :3;
      unsigned ICTSEL:3;
      unsigned ICSIDL:1;
    };
    struct {
      unsigned ICM0:1;
      unsigned ICM1:1;
      unsigned ICM2:1;
      unsigned :2;
      unsigned ICI0:1;
      unsigned ICI1:1;
      unsigned :3;
      unsigned ICTSEL0:1;
      unsigned ICTSEL1:1;
      unsigned ICTSEL2:1;
    };
  };
} IC15CON1BITS;
extern volatile IC15CON1BITS IC15CON1bits __attribute__((__sfr__));

extern volatile unsigned int  IC15CON2 __attribute__((__sfr__));
__extension__ typedef struct tagIC15CON2BITS {
  union {
    struct {
      unsigned SYNCSEL:5;
      unsigned :1;
      unsigned TRIGSTAT:1;
      unsigned ICTRIG:1;
      unsigned IC32:1;
    };
    struct {
      unsigned SYNCSEL0:1;
      unsigned SYNCSEL1:1;
      unsigned SYNCSEL2:1;
      unsigned SYNCSEL3:1;
      unsigned SYNCSEL4:1;
    };
  };
} IC15CON2BITS;
extern volatile IC15CON2BITS IC15CON2bits __attribute__((__sfr__));

extern volatile unsigned int  IC15BUF __attribute__((__sfr__));
extern volatile unsigned int  IC15TMR __attribute__((__sfr__));
extern volatile unsigned int  IC16CON1 __attribute__((__sfr__));
__extension__ typedef struct tagIC16CON1BITS {
  union {
    struct {
      unsigned ICM:3;
      unsigned ICBNE:1;
      unsigned ICOV:1;
      unsigned ICI:2;
      unsigned :3;
      unsigned ICTSEL:3;
      unsigned ICSIDL:1;
    };
    struct {
      unsigned ICM0:1;
      unsigned ICM1:1;
      unsigned ICM2:1;
      unsigned :2;
      unsigned ICI0:1;
      unsigned ICI1:1;
      unsigned :3;
      unsigned ICTSEL0:1;
      unsigned ICTSEL1:1;
      unsigned ICTSEL2:1;
    };
  };
} IC16CON1BITS;
extern volatile IC16CON1BITS IC16CON1bits __attribute__((__sfr__));

extern volatile unsigned int  IC16CON2 __attribute__((__sfr__));
__extension__ typedef struct tagIC16CON2BITS {
  union {
    struct {
      unsigned SYNCSEL:5;
      unsigned :1;
      unsigned TRIGSTAT:1;
      unsigned ICTRIG:1;
      unsigned IC32:1;
    };
    struct {
      unsigned SYNCSEL0:1;
      unsigned SYNCSEL1:1;
      unsigned SYNCSEL2:1;
      unsigned SYNCSEL3:1;
      unsigned SYNCSEL4:1;
    };
  };
} IC16CON2BITS;
extern volatile IC16CON2BITS IC16CON2bits __attribute__((__sfr__));

extern volatile unsigned int  IC16BUF __attribute__((__sfr__));
extern volatile unsigned int  IC16TMR __attribute__((__sfr__));
extern volatile unsigned int  QEI1CON __attribute__((__sfr__));
typedef struct tagQEI1CONBITS {
  unsigned CCM:2;
  unsigned GATEN:1;
  unsigned CNTPOL:1;
  unsigned INTDIV:3;
  unsigned :1;
  unsigned IMV:2;
  unsigned PIMOD:3;
  unsigned QEISIDL:1;
  unsigned :1;
  unsigned QEIEN:1;
} QEI1CONBITS;
extern volatile QEI1CONBITS QEI1CONbits __attribute__((__sfr__));

extern volatile unsigned int  QEI1IOC __attribute__((__sfr__));
typedef struct tagQEI1IOCBITS {
  unsigned QEA:1;
  unsigned QEB:1;
  unsigned INDEX:1;
  unsigned HOME:1;
  unsigned QEAPOL:1;
  unsigned QEBPOL:1;
  unsigned IDXPOL:1;
  unsigned HOMPOL:1;
  unsigned SWPAB:1;
  unsigned OUTFNC:2;
  unsigned QFDIV:3;
  unsigned FLTREN:1;
  unsigned QCAPEN:1;
} QEI1IOCBITS;
