thelemon22/regis/demo_projects/dsPIC33E/h/p33EP256MU814.h
extern volatile RPINR35BITS RPINR35bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR36 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR36BITS {
  union {
    struct {
      unsigned IC15R:7;
      unsigned :1;
      unsigned IC16R:7;
    };
    struct {
      unsigned IC15R0:1;
      unsigned IC15R1:1;
      unsigned IC15R2:1;
      unsigned IC15R3:1;
      unsigned IC15R4:1;
      unsigned IC15R5:1;
      unsigned IC15R6:1;
      unsigned :1;
      unsigned IC16R0:1;
      unsigned IC16R1:1;
      unsigned IC16R2:1;
      unsigned IC16R3:1;
      unsigned IC16R4:1;
      unsigned IC16R5:1;
      unsigned IC16R6:1;
    };
  };
} RPINR36BITS;
extern volatile RPINR36BITS RPINR36bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR37 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR37BITS {
  union {
    struct {
      unsigned OCFCR:7;
      unsigned :1;
      unsigned SYNCI1R:7;
    };
    struct {
      unsigned OCFCR0:1;
      unsigned OCFCR1:1;
      unsigned OCFCR2:1;
      unsigned OCFCR3:1;
      unsigned OCFCR4:1;
      unsigned OCFCR5:1;
      unsigned OCFCR6:1;
      unsigned :1;
      unsigned SYNCI1R0:1;
      unsigned SYNCI1R1:1;
      unsigned SYNCI1R2:1;
      unsigned SYNCI1R3:1;
      unsigned SYNCI1R4:1;
      unsigned SYNCI1R5:1;
      unsigned SYNCI1R6:1;
    };
  };
} RPINR37BITS;
extern volatile RPINR37BITS RPINR37bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR38 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR38BITS {
  union {
    struct {
      unsigned SYNCI2R:7;
      unsigned :1;
      unsigned DTCMP1R:7;
    };
    struct {
      unsigned SYNCI2R0:1;
      unsigned SYNCI2R1:1;
      unsigned SYNCI2R2:1;
      unsigned SYNCI2R3:1;
      unsigned SYNCI2R4:1;
      unsigned SYNCI2R5:1;
      unsigned SYNCI2R6:1;
      unsigned :1;
      unsigned DTCMP1R0:1;
      unsigned DTCMP1R1:1;
      unsigned DTCMP1R2:1;
      unsigned DTCMP1R3:1;
      unsigned DTCMP1R4:1;
      unsigned DTCMP1R5:1;
      unsigned DTCMP1R6:1;
    };
  };
} RPINR38BITS;
extern volatile RPINR38BITS RPINR38bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR39 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR39BITS {
  union {
    struct {
      unsigned DTCMP2R:7;
      unsigned :1;
      unsigned DTCMP3R:7;
    };
    struct {
      unsigned DTCMP2R0:1;
      unsigned DTCMP2R1:1;
      unsigned DTCMP2R2:1;
      unsigned DTCMP2R3:1;
      unsigned DTCMP2R4:1;
      unsigned DTCMP2R5:1;
      unsigned DTCMP2R6:1;
      unsigned :1;
      unsigned DTCMP3R0:1;
      unsigned DTCMP3R1:1;
      unsigned DTCMP3R2:1;
      unsigned DTCMP3R3:1;
      unsigned DTCMP3R4:1;
      unsigned DTCMP3R5:1;
      unsigned DTCMP3R6:1;
    };
  };
} RPINR39BITS;
extern volatile RPINR39BITS RPINR39bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR40 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR40BITS {
  union {
    struct {
      unsigned DTCMP4R:7;
      unsigned :1;
      unsigned DTCMP5R:7;
    };
    struct {
      unsigned DTCMP4R0:1;
      unsigned DTCMP4R1:1;
      unsigned DTCMP4R2:1;
      unsigned DTCMP4R3:1;
      unsigned DTCMP4R4:1;
      unsigned DTCMP4R5:1;
      unsigned DTCMP4R6:1;
      unsigned :1;
      unsigned DTCMP5R0:1;
      unsigned DTCMP5R1:1;
      unsigned DTCMP5R2:1;
      unsigned DTCMP5R3:1;
      unsigned DTCMP5R4:1;
      unsigned DTCMP5R5:1;
      unsigned DTCMP5R6:1;
    };
  };
} RPINR40BITS;
extern volatile RPINR40BITS RPINR40bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR41 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR41BITS {
  union {
    struct {
      unsigned DTCMP6R:7;
      unsigned :1;
      unsigned DTCMP7R:7;
    };
    struct {
      unsigned DTCMP6R0:1;
      unsigned DTCMP6R1:1;
      unsigned DTCMP6R2:1;
      unsigned DTCMP6R3:1;
      unsigned DTCMP6R4:1;
      unsigned DTCMP6R5:1;
      unsigned DTCMP6R6:1;
      unsigned :1;
      unsigned DTCMP7R0:1;
      unsigned DTCMP7R1:1;
      unsigned DTCMP7R2:1;
      unsigned DTCMP7R3:1;
      unsigned DTCMP7R4:1;
      unsigned DTCMP7R5:1;
      unsigned DTCMP7R6:1;
    };
  };
} RPINR41BITS;
extern volatile RPINR41BITS RPINR41bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR42 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR42BITS {
  union {
    struct {
      unsigned FLT5R:7;
      unsigned :1;
      unsigned FLT6R:7;
    };
    struct {
      unsigned FLT5R0:1;
      unsigned FLT5R1:1;
      unsigned FLT5R2:1;
      unsigned FLT5R3:1;
      unsigned FLT5R4:1;
      unsigned FLT5R5:1;
      unsigned FLT5R6:1;
      unsigned :1;
      unsigned FLT6R0:1;
      unsigned FLT6R1:1;
      unsigned FLT6R2:1;
      unsigned FLT6R3:1;
      unsigned FLT6R4:1;
      unsigned FLT6R5:1;
      unsigned FLT6R6:1;
    };
  };
} RPINR42BITS;
extern volatile RPINR42BITS RPINR42bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR43 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR43BITS {
  union {
    struct {
      unsigned FLT7R:7;
    };
    struct {
      unsigned FLT7R0:1;
      unsigned FLT7R1:1;
      unsigned FLT7R2:1;
      unsigned FLT7R3:1;
      unsigned FLT7R4:1;
      unsigned FLT7R5:1;
      unsigned FLT7R6:1;
    };
  };
} RPINR43BITS;
extern volatile RPINR43BITS RPINR43bits __attribute__((__sfr__));

extern volatile unsigned int  NVMCON __attribute__((__sfr__));
__extension__ typedef struct tagNVMCONBITS {
  union {
    struct {
      unsigned NVMOP:4;
      unsigned :8;
      unsigned NVMSIDL:1;
      unsigned WRERR:1;
      unsigned WREN:1;
      unsigned WR:1;
    };
    struct {
      unsigned NVMOP0:1;
      unsigned NVMOP1:1;
      unsigned NVMOP2:1;
      unsigned NVMOP3:1;
    };
  };
} NVMCONBITS;
extern volatile NVMCONBITS NVMCONbits __attribute__((__sfr__));

extern volatile unsigned int  NVMADR __attribute__((__sfr__));
extern volatile unsigned int  NVMADRU __attribute__((__sfr__));
typedef struct tagNVMADRUBITS {
  unsigned NVMADRU:8;
} NVMADRUBITS;
