thelemon22/regis/demo_projects/dsPIC33E/h/p33EP256MU814.h
extern volatile DMA11CONBITS DMA11CONbits __attribute__((__sfr__));

extern volatile unsigned int  DMA11REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA11REQBITS {
  union {
    struct {
      unsigned IRQSEL:8;
      unsigned :7;
      unsigned FORCE:1;
    };
    struct {
      unsigned IRQSEL0:1;
      unsigned IRQSEL1:1;
      unsigned IRQSEL2:1;
      unsigned IRQSEL3:1;
      unsigned IRQSEL4:1;
      unsigned IRQSEL5:1;
      unsigned IRQSEL6:1;
      unsigned IRQSEL7:1;
    };
  };
} DMA11REQBITS;
extern volatile DMA11REQBITS DMA11REQbits __attribute__((__sfr__));

extern volatile unsigned int  DMA11STAL __attribute__((__sfr__));
extern volatile unsigned int  DMA11STAH __attribute__((__sfr__));
typedef struct tagDMA11STAHBITS {
  unsigned STA:8;
} DMA11STAHBITS;
extern volatile DMA11STAHBITS DMA11STAHbits __attribute__((__sfr__));

extern volatile unsigned int  DMA11STBL __attribute__((__sfr__));
extern volatile unsigned int  DMA11STBH __attribute__((__sfr__));
typedef struct tagDMA11STBHBITS {
  unsigned STB:8;
} DMA11STBHBITS;
extern volatile DMA11STBHBITS DMA11STBHbits __attribute__((__sfr__));

extern volatile unsigned int  DMA11PAD __attribute__((__sfr__));
extern volatile unsigned int  DMA11CNT __attribute__((__sfr__));
typedef struct tagDMA11CNTBITS {
  unsigned CNT:14;
} DMA11CNTBITS;
extern volatile DMA11CNTBITS DMA11CNTbits __attribute__((__sfr__));

extern volatile unsigned int  DMA12CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA12CONBITS {
  union {
    struct {
      unsigned MODE:2;
      unsigned :2;
      unsigned AMODE:2;
      unsigned :5;
      unsigned NULLW:1;
      unsigned HALF:1;
      unsigned DIR:1;
      unsigned SIZE:1;
      unsigned CHEN:1;
    };
    struct {
      unsigned MODE0:1;
      unsigned MODE1:1;
      unsigned :2;
      unsigned AMODE0:1;
      unsigned AMODE1:1;
    };
  };
} DMA12CONBITS;
extern volatile DMA12CONBITS DMA12CONbits __attribute__((__sfr__));

extern volatile unsigned int  DMA12REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA12REQBITS {
  union {
    struct {
      unsigned IRQSEL:8;
      unsigned :7;
      unsigned FORCE:1;
    };
    struct {
      unsigned IRQSEL0:1;
      unsigned IRQSEL1:1;
      unsigned IRQSEL2:1;
      unsigned IRQSEL3:1;
      unsigned IRQSEL4:1;
      unsigned IRQSEL5:1;
      unsigned IRQSEL6:1;
      unsigned IRQSEL7:1;
    };
  };
} DMA12REQBITS;
extern volatile DMA12REQBITS DMA12REQbits __attribute__((__sfr__));

extern volatile unsigned int  DMA12STAL __attribute__((__sfr__));
extern volatile unsigned int  DMA12STAH __attribute__((__sfr__));
typedef struct tagDMA12STAHBITS {
  unsigned STA:8;
} DMA12STAHBITS;
extern volatile DMA12STAHBITS DMA12STAHbits __attribute__((__sfr__));

extern volatile unsigned int  DMA12STBL __attribute__((__sfr__));
extern volatile unsigned int  DMA12STBH __attribute__((__sfr__));
typedef struct tagDMA12STBHBITS {
  unsigned STB:8;
} DMA12STBHBITS;
extern volatile DMA12STBHBITS DMA12STBHbits __attribute__((__sfr__));

extern volatile unsigned int  DMA12PAD __attribute__((__sfr__));
extern volatile unsigned int  DMA12CNT __attribute__((__sfr__));
typedef struct tagDMA12CNTBITS {
  unsigned CNT:14;
} DMA12CNTBITS;
extern volatile DMA12CNTBITS DMA12CNTbits __attribute__((__sfr__));

extern volatile unsigned int  DMA13CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA13CONBITS {
  union {
    struct {
      unsigned MODE:2;
      unsigned :2;
      unsigned AMODE:2;
      unsigned :5;
      unsigned NULLW:1;
      unsigned HALF:1;
      unsigned DIR:1;
      unsigned SIZE:1;
      unsigned CHEN:1;
    };
    struct {
      unsigned MODE0:1;
      unsigned MODE1:1;
      unsigned :2;
      unsigned AMODE0:1;
      unsigned AMODE1:1;
    };
  };
} DMA13CONBITS;
extern volatile DMA13CONBITS DMA13CONbits __attribute__((__sfr__));

extern volatile unsigned int  DMA13REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA13REQBITS {
  union {
    struct {
      unsigned IRQSEL:8;
      unsigned :7;
      unsigned FORCE:1;
    };
    struct {
      unsigned IRQSEL0:1;
      unsigned IRQSEL1:1;
      unsigned IRQSEL2:1;
      unsigned IRQSEL3:1;
      unsigned IRQSEL4:1;
      unsigned IRQSEL5:1;
      unsigned IRQSEL6:1;
      unsigned IRQSEL7:1;
    };
  };
} DMA13REQBITS;
extern volatile DMA13REQBITS DMA13REQbits __attribute__((__sfr__));

extern volatile unsigned int  DMA13STAL __attribute__((__sfr__));
extern volatile unsigned int  DMA13STAH __attribute__((__sfr__));
typedef struct tagDMA13STAHBITS {
  unsigned STA:8;
} DMA13STAHBITS;
extern volatile DMA13STAHBITS DMA13STAHbits __attribute__((__sfr__));

extern volatile unsigned int  DMA13STBL __attribute__((__sfr__));
extern volatile unsigned int  DMA13STBH __attribute__((__sfr__));
typedef struct tagDMA13STBHBITS {
  unsigned STB:8;
} DMA13STBHBITS;
extern volatile DMA13STBHBITS DMA13STBHbits __attribute__((__sfr__));

extern volatile unsigned int  DMA13PAD __attribute__((__sfr__));
extern volatile unsigned int  DMA13CNT __attribute__((__sfr__));
typedef struct tagDMA13CNTBITS {
  unsigned CNT:14;
} DMA13CNTBITS;
extern volatile DMA13CNTBITS DMA13CNTbits __attribute__((__sfr__));

extern volatile unsigned int  DMA14CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA14CONBITS {
  union {
    struct {
      unsigned MODE:2;
      unsigned :2;
      unsigned AMODE:2;
      unsigned :5;
      unsigned NULLW:1;
      unsigned HALF:1;
      unsigned DIR:1;
      unsigned SIZE:1;
      unsigned CHEN:1;
    };
    struct {
      unsigned MODE0:1;
      unsigned MODE1:1;
      unsigned :2;
      unsigned AMODE0:1;
      unsigned AMODE1:1;
    };
  };
} DMA14CONBITS;
extern volatile DMA14CONBITS DMA14CONbits __attribute__((__sfr__));

extern volatile unsigned int  DMA14REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA14REQBITS {
  union {
    struct {
      unsigned IRQSEL:8;
      unsigned :7;
      unsigned FORCE:1;
    };
    struct {
      unsigned IRQSEL0:1;
      unsigned IRQSEL1:1;
      unsigned IRQSEL2:1;
      unsigned IRQSEL3:1;
      unsigned IRQSEL4:1;
      unsigned IRQSEL5:1;
      unsigned IRQSEL6:1;
      unsigned IRQSEL7:1;
    };
  };
} DMA14REQBITS;
