thelemon22/regis/demo_projects/dsPIC33E/h/p33EP256MU814.h
extern volatile unsigned int  CNPDG __attribute__((__sfr__));
typedef struct tagCNPDGBITS {
  unsigned CNPDG0:1;
  unsigned CNPDG1:1;
  unsigned :4;
  unsigned CNPDG6:1;
  unsigned CNPDG7:1;
  unsigned CNPDG8:1;
  unsigned CNPDG9:1;
  unsigned :2;
  unsigned CNPDG12:1;
  unsigned CNPDG13:1;
  unsigned CNPDG14:1;
  unsigned CNPDG15:1;
} CNPDGBITS;
extern volatile CNPDGBITS CNPDGbits __attribute__((__sfr__));

extern volatile unsigned int  ANSELG __attribute__((__sfr__));
typedef struct tagANSELGBITS {
  unsigned :6;
  unsigned ANSG6:1;
  unsigned ANSG7:1;
  unsigned ANSG8:1;
  unsigned ANSG9:1;
} ANSELGBITS;
extern volatile ANSELGBITS ANSELGbits __attribute__((__sfr__));

extern volatile unsigned int  TRISH __attribute__((__sfr__));
typedef struct tagTRISHBITS {
  unsigned TRISH0:1;
  unsigned TRISH1:1;
  unsigned TRISH2:1;
  unsigned TRISH3:1;
  unsigned TRISH4:1;
  unsigned TRISH5:1;
  unsigned TRISH6:1;
  unsigned TRISH7:1;
  unsigned TRISH8:1;
  unsigned TRISH9:1;
  unsigned TRISH10:1;
  unsigned TRISH11:1;
  unsigned TRISH12:1;
  unsigned TRISH13:1;
  unsigned TRISH14:1;
  unsigned TRISH15:1;
} TRISHBITS;
extern volatile TRISHBITS TRISHbits __attribute__((__sfr__));

extern volatile unsigned int  PORTH __attribute__((__sfr__));
typedef struct tagPORTHBITS {
  unsigned RH0:1;
  unsigned RH1:1;
  unsigned RH2:1;
  unsigned RH3:1;
  unsigned RH4:1;
  unsigned RH5:1;
  unsigned RH6:1;
  unsigned RH7:1;
  unsigned RH8:1;
  unsigned RH9:1;
  unsigned RH10:1;
  unsigned RH11:1;
  unsigned RH12:1;
  unsigned RH13:1;
  unsigned RH14:1;
  unsigned RH15:1;
} PORTHBITS;
extern volatile PORTHBITS PORTHbits __attribute__((__sfr__));

extern volatile unsigned int  LATH __attribute__((__sfr__));
typedef struct tagLATHBITS {
  unsigned LATH0:1;
  unsigned LATH1:1;
  unsigned LATH2:1;
  unsigned LATH3:1;
  unsigned LATH4:1;
  unsigned LATH5:1;
  unsigned LATH6:1;
  unsigned LATH7:1;
  unsigned LATH8:1;
  unsigned LATH9:1;
  unsigned LATH10:1;
  unsigned LATH11:1;
  unsigned LATH12:1;
  unsigned LATH13:1;
  unsigned LATH14:1;
  unsigned LATH15:1;
} LATHBITS;
extern volatile LATHBITS LATHbits __attribute__((__sfr__));

extern volatile unsigned int  ODCH __attribute__((__sfr__));
typedef struct tagODCHBITS {
  unsigned ODCH0:1;
  unsigned ODCH1:1;
  unsigned ODCH2:1;
  unsigned ODCH3:1;
  unsigned ODCH4:1;
  unsigned ODCH5:1;
  unsigned ODCH6:1;
  unsigned ODCH7:1;
  unsigned ODCH8:1;
  unsigned ODCH9:1;
  unsigned ODCH10:1;
  unsigned ODCH11:1;
  unsigned ODCH12:1;
  unsigned ODCH13:1;
  unsigned ODCH14:1;
  unsigned ODCH15:1;
} ODCHBITS;
extern volatile ODCHBITS ODCHbits __attribute__((__sfr__));

extern volatile unsigned int  CNENH __attribute__((__sfr__));
typedef struct tagCNENHBITS {
  unsigned CNIEH0:1;
  unsigned CNIEH1:1;
  unsigned CNIEH2:1;
  unsigned CNIEH3:1;
  unsigned CNIEH4:1;
  unsigned CNIEH5:1;
  unsigned CNIEH6:1;
  unsigned CNIEH7:1;
  unsigned CNIEH8:1;
  unsigned CNIEH9:1;
  unsigned CNIEH10:1;
  unsigned CNIEH11:1;
  unsigned CNIEH12:1;
  unsigned CNIEH13:1;
  unsigned CNIEH14:1;
  unsigned CNIEH15:1;
} CNENHBITS;
extern volatile CNENHBITS CNENHbits __attribute__((__sfr__));

extern volatile unsigned int  CNPUH __attribute__((__sfr__));
typedef struct tagCNPUHBITS {
  unsigned CNPUH0:1;
  unsigned CNPUH1:1;
  unsigned CNPUH2:1;
  unsigned CNPUH3:1;
  unsigned CNPUH4:1;
  unsigned CNPUH5:1;
  unsigned CNPUH6:1;
  unsigned CNPUH7:1;
  unsigned CNPUH8:1;
  unsigned CNPUH9:1;
  unsigned CNPUH10:1;
  unsigned CNPUH11:1;
  unsigned CNPUH12:1;
  unsigned CNPUH13:1;
  unsigned CNPUH14:1;
  unsigned CNPUH15:1;
} CNPUHBITS;
extern volatile CNPUHBITS CNPUHbits __attribute__((__sfr__));

extern volatile unsigned int  CNPDH __attribute__((__sfr__));
typedef struct tagCNPDHBITS {
  unsigned CNPDH0:1;
  unsigned CNPDH1:1;
  unsigned CNPDH2:1;
  unsigned CNPDH3:1;
  unsigned CNPDH4:1;
  unsigned CNPDH5:1;
  unsigned CNPDH6:1;
  unsigned CNPDH7:1;
  unsigned CNPDH8:1;
  unsigned CNPDH9:1;
  unsigned CNPDH10:1;
  unsigned CNPDH11:1;
  unsigned CNPDH12:1;
  unsigned CNPDH13:1;
  unsigned CNPDH14:1;
  unsigned CNPDH15:1;
} CNPDHBITS;
extern volatile CNPDHBITS CNPDHbits __attribute__((__sfr__));

extern volatile unsigned int  TRISJ __attribute__((__sfr__));
typedef struct tagTRISJBITS {
  unsigned TRISJ0:1;
  unsigned TRISJ1:1;
  unsigned TRISJ2:1;
  unsigned TRISJ3:1;
  unsigned TRISJ4:1;
  unsigned TRISJ5:1;
  unsigned TRISJ6:1;
  unsigned TRISJ7:1;
  unsigned TRISJ8:1;
  unsigned TRISJ9:1;
  unsigned TRISJ10:1;
  unsigned TRISJ11:1;
  unsigned TRISJ12:1;
  unsigned TRISJ13:1;
  unsigned TRISJ14:1;
  unsigned TRISJ15:1;
} TRISJBITS;
extern volatile TRISJBITS TRISJbits __attribute__((__sfr__));

extern volatile unsigned int  PORTJ __attribute__((__sfr__));
typedef struct tagPORTJBITS {
  unsigned RJ0:1;
  unsigned RJ1:1;
  unsigned RJ2:1;
  unsigned RJ3:1;
  unsigned RJ4:1;
  unsigned RJ5:1;
  unsigned RJ6:1;
  unsigned RJ7:1;
  unsigned RJ8:1;
  unsigned RJ9:1;
  unsigned RJ10:1;
  unsigned RJ11:1;
  unsigned RJ12:1;
  unsigned RJ13:1;
  unsigned RJ14:1;
  unsigned RJ15:1;
} PORTJBITS;
extern volatile PORTJBITS PORTJbits __attribute__((__sfr__));

extern volatile unsigned int  LATJ __attribute__((__sfr__));
typedef struct tagLATJBITS {
  unsigned LATJ0:1;
  unsigned LATJ1:1;
  unsigned LATJ2:1;
  unsigned LATJ3:1;
  unsigned LATJ4:1;
  unsigned LATJ5:1;
  unsigned LATJ6:1;
  unsigned LATJ7:1;
  unsigned LATJ8:1;
  unsigned LATJ9:1;
  unsigned LATJ10:1;
  unsigned LATJ11:1;
  unsigned LATJ12:1;
  unsigned LATJ13:1;
  unsigned LATJ14:1;
  unsigned LATJ15:1;
} LATJBITS;
extern volatile LATJBITS LATJbits __attribute__((__sfr__));

extern volatile unsigned int  ODCJ __attribute__((__sfr__));
typedef struct tagODCJBITS {
  unsigned ODCJ0:1;
  unsigned ODCJ1:1;
  unsigned ODCJ2:1;
  unsigned ODCJ3:1;
  unsigned ODCJ4:1;
  unsigned ODCJ5:1;
  unsigned ODCJ6:1;
  unsigned ODCJ7:1;
  unsigned ODCJ8:1;
  unsigned ODCJ9:1;
  unsigned ODCJ10:1;
  unsigned ODCJ11:1;
  unsigned ODCJ12:1;
  unsigned ODCJ13:1;
  unsigned ODCJ14:1;
  unsigned ODCJ15:1;
} ODCJBITS;
extern volatile ODCJBITS ODCJbits __attribute__((__sfr__));

