thelemon22/regis/demo_projects/dsPIC33E/h/p33EP256MU814.h
extern volatile unsigned int  CNENJ __attribute__((__sfr__));
typedef struct tagCNENJBITS {
  unsigned CNIEJ0:1;
  unsigned CNIEJ1:1;
  unsigned CNIEJ2:1;
  unsigned CNIEJ3:1;
  unsigned CNIEJ4:1;
  unsigned CNIEJ5:1;
  unsigned CNIEJ6:1;
  unsigned CNIEJ7:1;
  unsigned CNIEJ8:1;
  unsigned CNIEJ9:1;
  unsigned CNIEJ10:1;
  unsigned CNIEJ11:1;
  unsigned CNIEJ12:1;
  unsigned CNIEJ13:1;
  unsigned CNIEJ14:1;
  unsigned CNIEJ15:1;
} CNENJBITS;
extern volatile CNENJBITS CNENJbits __attribute__((__sfr__));

extern volatile unsigned int  CNPUJ __attribute__((__sfr__));
typedef struct tagCNPUJBITS {
  unsigned CNPUJ0:1;
  unsigned CNPUJ1:1;
  unsigned CNPUJ2:1;
  unsigned CNPUJ3:1;
  unsigned CNPUJ4:1;
  unsigned CNPUJ5:1;
  unsigned CNPUJ6:1;
  unsigned CNPUJ7:1;
  unsigned CNPUJ8:1;
  unsigned CNPUJ9:1;
  unsigned CNPUJ10:1;
  unsigned CNPUJ11:1;
  unsigned CNPUJ12:1;
  unsigned CNPUJ13:1;
  unsigned CNPUJ14:1;
  unsigned CNPUJ15:1;
} CNPUJBITS;
extern volatile CNPUJBITS CNPUJbits __attribute__((__sfr__));

extern volatile unsigned int  CNPDJ __attribute__((__sfr__));
typedef struct tagCNPDJBITS {
  unsigned CNPDJ0:1;
  unsigned CNPDJ1:1;
  unsigned CNPDJ2:1;
  unsigned CNPDJ3:1;
  unsigned CNPDJ4:1;
  unsigned CNPDJ5:1;
  unsigned CNPDJ6:1;
  unsigned CNPDJ7:1;
  unsigned CNPDJ8:1;
  unsigned CNPDJ9:1;
  unsigned CNPDJ10:1;
  unsigned CNPDJ11:1;
  unsigned CNPDJ12:1;
  unsigned CNPDJ13:1;
  unsigned CNPDJ14:1;
  unsigned CNPDJ15:1;
} CNPDJBITS;
extern volatile CNPDJBITS CNPDJbits __attribute__((__sfr__));

extern volatile unsigned int  TRISK __attribute__((__sfr__));
typedef struct tagTRISKBITS {
  unsigned TRISK0:1;
  unsigned TRISK1:1;
  unsigned :9;
  unsigned TRISK11:1;
  unsigned TRISK12:1;
  unsigned TRISK13:1;
  unsigned TRISK14:1;
  unsigned TRISK15:1;
} TRISKBITS;
extern volatile TRISKBITS TRISKbits __attribute__((__sfr__));

extern volatile unsigned int  PORTK __attribute__((__sfr__));
typedef struct tagPORTKBITS {
  unsigned RK0:1;
  unsigned RK1:1;
  unsigned :9;
  unsigned RK11:1;
  unsigned RK12:1;
  unsigned RK13:1;
  unsigned RK14:1;
  unsigned RK15:1;
} PORTKBITS;
extern volatile PORTKBITS PORTKbits __attribute__((__sfr__));

extern volatile unsigned int  LATK __attribute__((__sfr__));
typedef struct tagLATKBITS {
  unsigned LATK0:1;
  unsigned LATK1:1;
  unsigned :9;
  unsigned LATK11:1;
  unsigned LATK12:1;
  unsigned LATK13:1;
  unsigned LATK14:1;
  unsigned LATK15:1;
} LATKBITS;
extern volatile LATKBITS LATKbits __attribute__((__sfr__));

extern volatile unsigned int  ODCK __attribute__((__sfr__));
typedef struct tagODCKBITS {
  unsigned ODCK0:1;
  unsigned ODCK1:1;
  unsigned :9;
  unsigned ODCK11:1;
  unsigned ODCK12:1;
  unsigned ODCK13:1;
  unsigned ODCK14:1;
  unsigned ODCK15:1;
} ODCKBITS;
extern volatile ODCKBITS ODCKbits __attribute__((__sfr__));

extern volatile unsigned int  CNENK __attribute__((__sfr__));
typedef struct tagCNENKBITS {
  unsigned CNIEK0:1;
  unsigned CNIEK1:1;
  unsigned :9;
  unsigned CNIEK11:1;
  unsigned CNIEK12:1;
  unsigned CNIEK13:1;
  unsigned CNIEK14:1;
  unsigned CNIEK15:1;
} CNENKBITS;
extern volatile CNENKBITS CNENKbits __attribute__((__sfr__));

extern volatile unsigned int  CNPUK __attribute__((__sfr__));
typedef struct tagCNPUKBITS {
  unsigned CNPUK0:1;
  unsigned CNPUK1:1;
  unsigned :9;
  unsigned CNPUK11:1;
  unsigned CNPUK12:1;
  unsigned CNPUK13:1;
  unsigned CNPUK14:1;
  unsigned CNPUK15:1;
} CNPUKBITS;
extern volatile CNPUKBITS CNPUKbits __attribute__((__sfr__));

extern volatile unsigned int  CNPDK __attribute__((__sfr__));
typedef struct tagCNPDKBITS {
  unsigned CNPDK0:1;
  unsigned CNPDK1:1;
  unsigned :9;
  unsigned CNPDK11:1;
  unsigned CNPDK12:1;
  unsigned CNPDK13:1;
  unsigned CNPDK14:1;
  unsigned CNPDK15:1;
} CNPDKBITS;
extern volatile CNPDKBITS CNPDKbits __attribute__((__sfr__));

extern volatile unsigned int  PADCFG1 __attribute__((__sfr__));
typedef struct tagPADCFG1BITS {
  unsigned PMPTTL:1;
  unsigned RTSECSEL:1;
} PADCFG1BITS;
extern volatile PADCFG1BITS PADCFG1bits __attribute__((__sfr__));



/* ---------------------------------------------------------- */
/* Defines for unique SFR bit names                           */
/* ---------------------------------------------------------- */

/* DSRPAG */
#define _DSRPAG DSRPAGbits.DSRPAG

/* DSWPAG */
#define _DSWPAG DSWPAGbits.DSWPAG

/* SR */
#define _C SRbits.C
#define _Z SRbits.Z
#define _OV SRbits.OV
#define _N SRbits.N
#define _RA SRbits.RA
#define _IPL SRbits.IPL
/* Bitname _DC cannot be defined because it is used by more than one SFR */
#define _DA SRbits.DA
#define _SAB SRbits.SAB
#define _OAB SRbits.OAB
#define _SB SRbits.SB
#define _SA SRbits.SA
#define _OB SRbits.OB
#define _OA SRbits.OA
#define _IPL0 SRbits.IPL0
#define _IPL1 SRbits.IPL1
#define _IPL2 SRbits.IPL2

/* CORCON */
#define _IF CORCONbits.IF
#define _RND CORCONbits.RND
#define _SFA CORCONbits.SFA
#define _IPL3 CORCONbits.IPL3
#define _ACCSAT CORCONbits.ACCSAT
#define _SATDW CORCONbits.SATDW
#define _SATB CORCONbits.SATB
#define _SATA CORCONbits.SATA
#define _DL CORCONbits.DL
#define _EDT CORCONbits.EDT
#define _US CORCONbits.US
#define _VAR CORCONbits.VAR
#define _DL0 CORCONbits.DL0
#define _DL1 CORCONbits.DL1
#define _DL2 CORCONbits.DL2
#define _US0 CORCONbits.US0
#define _US1 CORCONbits.US1

/* MODCON */
#define _XWM MODCONbits.XWM
#define _YWM MODCONbits.YWM
#define _BWM MODCONbits.BWM
#define _YMODEN MODCONbits.YMODEN
#define _XMODEN MODCONbits.XMODEN
#define _XWM0 MODCONbits.XWM0
#define _XWM1 MODCONbits.XWM1
#define _XWM2 MODCONbits.XWM2
#define _XWM3 MODCONbits.XWM3
#define _YWM0 MODCONbits.YWM0
#define _YWM1 MODCONbits.YWM1
#define _YWM2 MODCONbits.YWM2
#define _YWM3 MODCONbits.YWM3
#define _BWM0 MODCONbits.BWM0
#define _BWM1 MODCONbits.BWM1
#define _BWM2 MODCONbits.BWM2
#define _BWM3 MODCONbits.BWM3

/* XBREV */
#define _XB XBREVbits.XB
#define _BREN XBREVbits.BREN
#define _XB0 XBREVbits.XB0
#define _XB1 XBREVbits.XB1
#define _XB2 XBREVbits.XB2
#define _XB3 XBREVbits.XB3
#define _XB4 XBREVbits.XB4
#define _XB5 XBREVbits.XB5
#define _XB6 XBREVbits.XB6
#define _XB7 XBREVbits.XB7
#define _XB8 XBREVbits.XB8
#define _XB9 XBREVbits.XB9
#define _XB10 XBREVbits.XB10
#define _XB11 XBREVbits.XB11
#define _XB12 XBREVbits.XB12
#define _XB13 XBREVbits.XB13
#define _XB14 XBREVbits.XB14

/* TBLPAG */
#define _TBLPAG TBLPAGbits.TBLPAG

