thelemon22/regis/demo_projects/dsPIC33E/h/p33EP256MU814.h
/* C2RXM1SID */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */
/* Bitname _MIDE cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID cannot be defined because it is used by more than one SFR */

/* C2TR45CON */
/* Bitname _TX4PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN4 cannot be defined because it is used by more than one SFR */
/* Bitname _TX5PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN5 cannot be defined because it is used by more than one SFR */
/* Bitname _TX4PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX4PRI1 cannot be defined because it is used by more than one SFR */
/* Bitname _TX5PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX5PRI1 cannot be defined because it is used by more than one SFR */

/* C2RXM1EID */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */

/* C2TR67CON */
/* Bitname _TX6PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN6 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ6 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR6 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB6 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT6 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN6 cannot be defined because it is used by more than one SFR */
/* Bitname _TX7PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN7 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ7 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR7 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB7 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT7 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN7 cannot be defined because it is used by more than one SFR */
/* Bitname _TX6PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX6PRI1 cannot be defined because it is used by more than one SFR */
/* Bitname _TX7PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX7PRI1 cannot be defined because it is used by more than one SFR */

/* C2RXM2SID */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */
/* Bitname _MIDE cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID cannot be defined because it is used by more than one SFR */

/* C2RXM2EID */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */

/* C2RXF0SID */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */
/* Bitname _EXIDE cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID cannot be defined because it is used by more than one SFR */

