thelemon22/regis/demo_projects/dsPIC33E/h/p33EP256MU814.h
/*
** Only one invocation of FPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPOR.
** Multiple options may be combined, as shown:
**
** _FPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Power-on Reset Timer Value Select bits:
**     FPWRT_PWR1           Disabled
**     FPWRT_PWR2           2ms
**     FPWRT_PWR4           4ms
**     FPWRT_PWR8           8ms
**     FPWRT_PWR16          16ms
**     FPWRT_PWR32          32ms
**     FPWRT_PWR64          64ms
**     FPWRT_PWR128         128ms
**
**   Brown-out Reset (BOR) Detection Enable bit:
**     BOREN_OFF            BOR is disabled
**     BOREN_ON             BOR is enabled
**
**   Alternate I2C pins for I2C1:
**     ALTI2C1_ON           ASDA1/ASCK1 pins are selected as the I/O pins for I2C1
**     ALTI2C1_OFF          SDA1/SCK1 pins are selected as the I/O pins for I2C1
**
**   Alternate I2C pins for I2C2:
**     ALTI2C2_ON           ASDA2/ASCK2 pins are selected as the I/O pins for I2C2
**     ALTI2C2_OFF          SDA2/SCK2 pins are selected as the I/O pins for I2C2
**
*/

#define FPWRT_PWR1           0xFFF8
#define FPWRT_PWR2           0xFFF9
#define FPWRT_PWR4           0xFFFA
#define FPWRT_PWR8           0xFFFB
#define FPWRT_PWR16          0xFFFC
#define FPWRT_PWR32          0xFFFD
#define FPWRT_PWR64          0xFFFE
#define FPWRT_PWR128         0xFFFF

#define BOREN_OFF            0xFFF7
#define BOREN_ON             0xFFFF

#define ALTI2C1_ON           0xFFEF
#define ALTI2C1_OFF          0xFFFF

#define ALTI2C2_ON           0xFFDF
#define ALTI2C2_OFF          0xFFFF

/* Register FICD (0xf8000e)                               */

extern __attribute__((space(prog))) int _FICD;
#define _FICD(x) __attribute__((section("__FICD.sec"),space(prog))) int _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   ICD Communication Channel Select bits:
**     ICS_NONE             Reserved, do not use
**     ICS_PGD3             Communicate on PGEC3 and PGED3
**     ICS_PGD2             Communicate on PGEC2 and PGED2
**     ICS_PGD1             Communicate on PGEC1 and PGED1
**
**   Reset Target Vector Select bit:
**     RSTPRI_AF            Device will obtain reset instruction from Aux flash
**     RSTPRI_PF            Device will obtain reset instruction from Primary flash
**
**   JTAG Enable bit:
**     JTAGEN_OFF           JTAG is disabled
**     JTAGEN_ON            JTAG is enabled
**
*/

#define ICS_NONE             0xFFFC
#define ICS_PGD3             0xFFFD
#define ICS_PGD2             0xFFFE
#define ICS_PGD1             0xFFFF

#define RSTPRI_AF            0xFFFB
#define RSTPRI_PF            0xFFFF

#define JTAGEN_OFF           0xFFDF
#define JTAGEN_ON            0xFFFF

/* Register FAS (0xf80010)                               */

extern __attribute__((space(prog))) int _FAS;
#define _FAS(x) __attribute__((section("__FAS.sec"),space(prog))) int _FAS = (x);

/*
** Only one invocation of FAS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FAS.
** Multiple options may be combined, as shown:
**
** _FAS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Auxiliary Segment Write-protect bit:
**     AWRP_ON              Aux Flash is write protected
**     AWRP_OFF             Aux Flash may be written
**
**   Auxiliary Segment Code-protect bit:
**     APL_ON               Aux Flash Code protect is enabled
**     APL_OFF              Aux Flash Code protect is disabled
**
**   Auxiliary Segment Key bits:
**     APLK_OFF             Aux Flash Write Protection and Code Protection is Disabled
**     APLK_ON              Aux Flash Write Protection or Code Protection is Enabled
**
*/

#define AWRP_ON              0xFFFE
#define AWRP_OFF             0xFFFF

#define APL_ON               0xFFFD
#define APL_OFF              0xFFFF

#define APLK_OFF             0xFFCF
#define APLK_ON              0xFFFF

/* Register FUID0 (0xf80012)                               */

extern __attribute__((space(prog))) int _FUID0;
#define _FUID0(x) __attribute__((section("__FUID0.sec"),space(prog))) int _FUID0 = (x);

/*
** Only one invocation of FUID0 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FUID0.
** Multiple options may be combined, as shown:
**
** _FUID0( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   :
**
*/



#endif
